app/controllers/cards_controller.rb

  def create
    @card = Card.new(card_params)
    @card.topic_id = params[:topic_id]

    if @card.save
---
INSERT INTO "cards" ("title", "definition", "created_at", "updated_at", "topic_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"

  def update
    if @card.update(card_params)
---
UPDATE "cards" SET "title" = $1, "definition" = $2, "updated_at" = $3 WHERE "cards"."id" = $4  [["title", ""], ["definition", "testing 123"], ["updated_at", "2020-05-10 14:53:29.686979"], ["id", 23]]

  def destroy
    @card.destroy
---
DELETE FROM "cards" WHERE "cards"."id" = $1  [["id", 8]]

    def set_card
      @card = Card.find(params[:id])
---
SELECT "cards".* FROM "cards" WHERE "cards"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]