app/controllers/topics_controller.rb

  def create
    @topic = Topic.new(topic_params)

    if @topic.save
---
INSERT INTO "topics" ("title", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["title", "Dog Breed"], ["created_at", "2020-05-07 01:51:33.444991"], ["updated_at", "2020-05-07 01:51:33.444991"]]

  def update
    if @topic.update(topic_params)
---
UPDATE "topics" SET "title" = $1, "updated_at" = $2 WHERE "topics"."id" = $3  [["title", "Food Items"], ["updated_at", "2020-05-10 16:26:43.657036"], ["id", 17]]

  def destroy
    @topic.destroy
---
DELETE FROM "topics" WHERE "topics"."id" = $1  [["id", 3]]